#include<stdio.h>
#include<windows.h>

using namespace std;

char s1[20], s2[20], s3[20];
unsigned int t1, t2, t3;
int q1, q2, q3;
unsigned int weight1, weight2, weight3;

int main() {

	SetConsoleOutputCP(1251);
	SetConsoleCP(1251);

	printf("1. Введите: наименование, тип, количество, вес 1 детали(г): ");
	scanf_s("%s%c%d%u", s1, (unsigned)_countof(s1), &t1, &q1, &weight1);

	printf("2. Введите: наименование, тип, количество, вес 1 детали(г):  ");
	scanf_s("%s%c%d%u", s2, (unsigned)_countof(s2), &t2, &q2, &weight2);

	printf("3. Введите: наименование, тип, количество, вес 1 детали(г):  ");
	scanf_s("%s%c%d%u", s3, (unsigned)_countof(s3), &t3, &q3, &weight3);

	printf("-------------------------------------------------------------------------------\n");
	printf("| Ведомость деталей                                                           |\n");
	printf("-------------------------------------------------------------------------------\n");
	printf("| Наименование | Тип   | Количество  | Вес 1 детали(г)   |\n");
	printf("|-----------|-----------------|-----------------------|-----------------------|\n");
	printf("| %6s  | %c| %d| %u|\n", s1, t1, q1, weight1);
	printf("|-----------|-----------------|-----------------------|-----------------------|\n");
	printf("| %10s  | %c| %d| %u|\n", s2, t2, q2, weight2);
	printf("|-----------|-----------------|-----------------------|-----------------------|\n");
	printf("| %7s    | %c| %d| %u|\n", s3, t3, q3, weight3);
	printf("|-----------------------------------------------------------------------------|\n");
	printf("| Примечание: принято такое кодирование типов: О - оригинальная, П - покупная, З - заимствованная  |\n");
	printf("-------------------------------------------------------------------------------\n");
}